# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3
import pandas as pd
connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cursor = connection.cursor()

## Display the names of all the employees in Boston.

In [7]:
#Your code here
cursor.execute('''
SELECT firstName, lastName FROM employees e
            JOIN offices o
            ON e.officeCode = o.officeCode;
            ''')
df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
df.head()

  firstName   lastName
0     Diane     Murphy
1      Mary  Patterson
2      Jeff   Firrelli
3   William  Patterson
4    Gerard     Bondur

## Do any offices have no employees?

In [21]:
#Your code here
cursor.execute('''
SELECT city, count(*) FROM offices
                      LEFT JOIN employees
                      USING(officeCode)
                      GROUP BY 1;
''')

df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
df.head()

            city  count(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
Which customers buy the most products?
Which sales rep brought in the most money?
Which sales rep represents the most clients?

In [24]:
# Your code here
cursor.execute('''
SELECT customerName, COUNT(*) FROM customers
                              JOIN orders
                              USING(customerNumber)
                              GROUP BY 1
                              ORDER BY count(*) DESC
                              LIMIT 1;
''')
df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
df.head()

             customerName  COUNT(*)
0  Euro+ Shopping Channel        26

In [28]:
# Your code here
cursor.execute('''
SELECT c.salesRepEmployeeNumber, sum(amount) FROM payments p
                   JOIN customers c
                   USING(customerNumber)
                   GROUP BY salesRepEmployeeNumber
                   ORDER BY sum(amount) DESC;
''')

df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
df.head()

  salesRepEmployeeNumber  sum(amount)
0                   1370   1112003.81
1                   1165    989906.55
2                   1401    750201.87
3                   1501    686653.25
4                   1504    637672.65

In [29]:
# Your code here
cursor.execute('''
SELECT e.lastName, count(customerNumber) FROM employees e
        JOIN customers c
        ON e.employeeNumber = c.salesRepEmployeeNumber
        GROUP BY e.employeeNumber
        ORDER BY count(customerNumber) DESC;
''')

df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
df.head()

   lastName  count(customerNumber)
0  Castillo                     10
1     Jones                      9
2    Vanauf                      8
3      Bott                      8
4     Tseng                      7

## Level Up: Display the names of each product each employee has sold.

In [34]:
# Your code here
cursor.execute('''
SELECT lastName, productName FROM employees e
                JOIN customers c
                ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o
                USING(customerNumber)
                JOIN orderdetails od
                USING(orderNumber)
                JOIN products p
                USING(productCode);
                
''')

df = pd.DataFrame(cursor.fetchall())
# df.columns = [i[0] for i in cursor.description]
print(len(df))
df.head()

2996

          0                                            1
0  Jennings                               1958 Setra Bus
1  Jennings                       1940 Ford Pickup Truck
2  Jennings                      1939 Cadillac Limousine
3  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [36]:
#Your code here
cursor.execute('''
SELECT lastName, count(productName) FROM employees e
                JOIN customers c
                ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o
                USING(customerNumber)
                JOIN orderdetails od
                USING(orderNumber)
                JOIN products p
                USING(productCode)
                GROUP BY lastName;
                
''')

df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
# print(len(df))
df.head()

   lastName  count(productName)
0    Bondur                 177
1      Bott                 236
2  Castillo                 272
3  Firrelli                 124
4    Fixter                 185

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!